hackathon/src/InformationRegisters/СостояниеОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостояниеОбращений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбращения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СлужебныйКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обращения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

hackathon/src/Enums/СтатусыОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыОбращения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

hackathon/src/InformationRegisters/СостояниеОбращений/ManagerModule.bsl
Функция ПолучитьВремяРеакцииНаТекПериод(Обращение, ДатаСеанса) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(СостояниеОбращенийСрезПервых.Период, &ТекПериод, МИНУТА) КАК Реакция,
		|	СостояниеОбращенийСрезПервых.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СостояниеОбращений.СрезПервых КАК СостояниеОбращенийСрезПервых
		|ГДЕ
		|	СостояниеОбращенийСрезПервых.Обращение = &Обращение
		|	И СостояниеОбращенийСрезПервых.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбращения.Новое)";
	
	Запрос.УстановитьПараметр("Обращение", Обращение);
	Запрос.УстановитьПараметр("ТекПериод", ДатаСеанса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Число(ВыборкаДетальныеЗаписи.Реакция); 
	КонецЦикла;
	
	Возврат 0;
КонецФункции  

Функция ПолучитьВремяРешенияНаТекПериод(Обращение, ДатаСеанса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(СостояниеОбращенийСрезПоследних.Период, &ТекПериод, МИНУТА) КАК Решение,
		|	СостояниеОбращенийСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СостояниеОбращений.СрезПоследних КАК СостояниеОбращенийСрезПоследних
		|ГДЕ
		|	СостояниеОбращенийСрезПоследних.Обращение = &Обращение
		|	И СостояниеОбращенийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбращения.ВРаботе)";
	
	Запрос.УстановитьПараметр("Обращение", Обращение); 
	Запрос.УстановитьПараметр("ТекПериод", ДатаСеанса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Число(ВыборкаДетальныеЗаписи.Решение); 
	КонецЦикла;	
	
	Возврат 0 ;
КонецФункции
